kyyang28/stm32f407disc_pid/src/quad/target/13-PID/main.c

#include "system_stm32f4xx.h"
#include "stm32f4xx_rcc.h"
#include "stm32f4xx_gpio.h"
#include "misc.h"
#include "nvic.h"
#include "system.h"
#include "led.h"
#include "sound_beeper.h"
#include "config.h"
#include "configMaster.h"	// including gyro.h, acceleration.h, boardAlignment.h
#include "config_eeprom.h"
#include "exti.h"
#include "button.h"
#include "serial.h"
//#include "msp_serial.h"
//#include "printf.h"
#include "gps.h"
#include "rxSerial1Test.h"
#include "rxSerial3Test.h"
#include "rxSerial6Test.h"
#include <stdio.h>
#include "bus_i2c.h"
#include "bitband_i2c_soft.h"					// self-implemented i2c protocol
#include "bus_spi.h"
#include "initialisation.h"
#include "accgyro_spi_mpu9250.h"
//#include "gyro.h"
//#include "acceleration.h"
//#include "boardAlignment.h"
#include "maths.h"

//#include "mpu6050.h"
//#include "mpu6050_soft_i2c.h"					// for MPU6050 testing purposes
#include "mpu9250_soft_i2c.h"					// for MPU9250 testing purposes
//#include "inv_mpu.h"							// for MPU6050/MPU9250 DMP testing purposes
//#include "inv_mpu_dmp_motion_driver.h"			// for MPU6050/MPU9250 DMP testing purposes

#include "pwm_output.h"			// including timer.h ledTimer.h
#include "rx_pwm.h"
#include "rx.h"
#include "feature.h"

#include "time.h"				// allow to use timeUs_t which is uint32_t
#include "fc_core.h"
#include "fc_tasks.h"           // fcTasksInit()
#include "scheduler.h"          // cfTask_t

#include "mixer.h"

#include "debug.h"

#include "sdcard.h"
#include "asyncfatfs.h"

#include "blackbox.h"
#include "blackbox_io.h"

#include "pid.h"

#include "runtime_config.h"


//#define GPIO_PA1_PIN				PA1
//#define GPIO_PB8_PIN				PB8

//uint32_t counter = 0;

//uint32_t currentTimeUs;

//uint32_t base = 1;
//uint32_t sub = 2;			// build = 0x00000050
//uint32_t build;
//uint32_t tmp1, tmp2, tmp3, tmp4, tmp5, tmp6, tmp7, tmp8;

//uint8_t __g_basepri_save, __g_basepri_save2, __g_basepri_save3;
//uint8_t __g_ToDo, __g_ToDo2;
//uint8_t __basepriRestoreMem_inter;
//uint8_t basepri_val;
//int forCnt = 0;

//static IO_t g_scl;
//static IO_t g_sda;

typedef enum {
	SYSTEM_STATE_INITIALISING			= 0,
	SYSTEM_STATE_CONFIG_LOADED			= (1 << 0),
	SYSTEM_STATE_SENSORS_READY			= (1 << 1),
	SYSTEM_STATE_MOTORS_READY			= (1 << 2),
	SYSTEM_STATE_TRANSPONDER_ENABLED	= (1 << 3),
	SYSTEM_STATE_ALL_READY				= (1 << 7)
}systemState_e;

//int g_val = 0;

uint8_t systemState = SYSTEM_STATE_INITIALISING;
//IO_t PA1_PIN, PB8_PIN;


void systemInit(void);
//void gpioPA1Init(void);
//void gpioPA1Ops(void);
//void gpioPB8Init(void);
//void gpioPB8Ops(void);

//int i_cnt = 0;
//double f_cnt = 0.0;

#if 1
struct __FILE
{
    int dummy;
};

FILE __stdout;

int fputc(int ch, FILE *f)
{
    /* Send byte to USART */
//	gpsWrite(ch);
//	rxSerial1TestWrite(ch);
	rxSerial3TestWrite(ch);
//	rxSerial6TestWrite(ch);
    
    /* If everything is OK, you have to return character written */
    return ch;
    /* If character is not correct, you can return EOF (-1) to stop writing */
    //return -1;
}
#else
#ifdef __GNUC__
	#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
	#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif

PUTCHAR_PROTOTYPE
{
	rxSerial3TestWrite(ch);
	return ch;
}
#endif

//static IO_t mpuSpi9250CsPin = IO_NONE;

//bool sdaFlag = false;

//uint32_t TIM_ARR = 0;
//int16_t ledDutyCycle[LED_NUMBER];

//extern uint8_t TIM_CAPTURE_STATUS;			// status of timer input capture

extern uint8_t motorControlEnable;

static void comparisonBetweenFastNormalInvSqrt(void)
{
	const uint32_t iterations = 90000;
	const float num = M_PIf;
	float fastInvSqrtRes, regularInvSqrtRes;
	
	uint32_t fastStartTime, fastEndTime, regStartTime, regEndTime;
	fastStartTime = micros();
	
	for (uint32_t i = 0; i < iterations; i++) {
		fastInvSqrtRes = fastInvSqrt(num + i);
	}
	
	fastEndTime = micros();
	printf("fastInvSqrt(x) runs in %u us under %u iterations\r\n", (fastEndTime - fastStartTime), iterations);
	
	regStartTime = micros();
	
	for (uint32_t i = 0; i < iterations; i++) {
		regularInvSqrtRes = 1/sqrtf(num + i);
	}
	
	regEndTime = micros();
	printf("1/sqrtf(x) runs in %u us under %u iterations\r\n", (fastEndTime - fastStartTime), iterations);
//	printf("Input: %f, regRes: %f under %u us\r\n", num, regularInvSqrtRes, (regEndTime - regStartTime));

	if ((regEndTime - regStartTime) > (fastEndTime - fastStartTime)) {
		printf("fastInvSqrt(x) is %d times faster than 1/sqrtf(x)\r\n", (regEndTime - regStartTime) / (fastEndTime - fastStartTime));
	} else {
		printf("1/sqrtf(x) is %d times faster than fastInvSqrt(x)\r\n", (fastEndTime - fastStartTime) / (regEndTime - regStartTime));
	}	
}

void main_process(void)
{
    scheduler();
}

int main(void)
{
//	printfSupportInit();
	
	systemInit();
	
	/* Initialise IO (needed for all IO operations) */
	IOGlobalInit();
	
	/* Initialise EEPROM */
	initEEPROM();
	
	/* Check if EEPROM contains valid data */
	checkEEPROMContainsValidData();

	/* Initialise serial port usage list */
	serialInit(SerialConfig());

	/* Initialise debugging serial port */
//	rxSerial1TestInit();
	rxSerial3TestInit();
//	rxSerial6TestInit();
	
	/* Write masterConfig info into FLASH EEPROM
	 *
	 * TODO: (ISSUE) After calling writeEEPROM() function, the program will not be running when STM32F4 board is powered on
	 */
//	writeEEPROM();	// TODO: writeEEPROM() should be included inside the checkEEPROMContainsValidData() function
					//       separated here just for using printf (serialInit and rxSerial3TestInit initialised before writeEEPROM() and readEEPROM())
	
	/* Read masterConfig info from FLASH EEPROM */
	readEEPROM();
		
	/* Initialise MSP (MCU Support Package) serial */
//	mspSerialInit();

	/* IMPORTANT: the printf is functional only if the rxSerial3TestInit() function is initialised
	 * i.e., use printf debugger thereafter
	 */

//	printf("masterConfig.version: %u, %d\r\n", masterConfig.version, __LINE__);
//	printf("masterConfig.size: %u, %d\r\n", masterConfig.size, __LINE__);
//	printf("masterConfig.magic_be: 0x%x, %d\r\n", masterConfig.magic_be, __LINE__);
//	printf("masterConfig.magic_ef: 0x%x, %d\r\n", masterConfig.magic_ef, __LINE__);
//	printf("masterConfig.chk: %u, %d\r\n", masterConfig.chk, __LINE__);

//	gpsInit();	
//	gpsSetPrintfSerialPort();

