kyyang28/stm32f407disc_pid/src/quad/target/13-PID/main.c
	/* LedTimerConfig()->ioTags[xxx] initialisation done correctly */
//	printf("LedTimerConfig()->ioTags[0]: 0x%x\r\n", LedTimerConfig()->ioTags[0]);	// LED4, PD12, ioTag_t 0x4C
//	printf("LedTimerConfig()->ioTags[1]: 0x%x\r\n", LedTimerConfig()->ioTags[1]);	// LED3, PD13, ioTag_t 0x4D
//	printf("LedTimerConfig()->ioTags[2]: 0x%x\r\n", LedTimerConfig()->ioTags[2]);	// LED5, PD14, ioTag_t 0x4E
//	printf("LedTimerConfig()->ioTags[3]: 0x%x\r\n", LedTimerConfig()->ioTags[3]);	// LED6, PD15, ioTag_t 0x4F
	
	/* PwmConfig()->ioTags[xxx] initialisation done correctly */
//	printf("PwmConfig()->ioTags[0]: 0x%x\r\n", PwmConfig()->ioTags[0]);
//	printf("PwmConfig()->ioTags[1]: 0x%x\r\n", PwmConfig()->ioTags[1]);
//	printf("PwmConfig()->ioTags[2]: 0x%x\r\n", PwmConfig()->ioTags[2]);
//	printf("PwmConfig()->ioTags[3]: 0x%x\r\n", PwmConfig()->ioTags[3]);
//	printf("PwmConfig()->ioTags[4]: 0x%x\r\n", PwmConfig()->ioTags[4]);
//	printf("PwmConfig()->ioTags[5]: 0x%x\r\n", PwmConfig()->ioTags[5]);
//	printf("PwmConfig()->ioTags[6]: 0x%x\r\n", PwmConfig()->ioTags[6]);
//	printf("PwmConfig()->ioTags[7]: 0x%x\r\n", PwmConfig()->ioTags[7]);

	/* Read the contents of EEPROM */
//	ReadEEPROM();
	
	systemState |= SYSTEM_STATE_CONFIG_LOADED;
	
	debugMode = masterConfig.debug_mode;
	
	/* IMPORTANT: 
	 * 		DO NOT FORGET TO CALL latchActiveFeatures() function to perform the following action
	 *			activeFeaturesLatch = masterConfig.enabledFeatures
	 * Latch active features to be used for feature() in the remainder of init()
	 */
	latchActiveFeatures();
//	printf("masterConfig.enabledFeatures: 0x%x, %s, %d\r\n", masterConfig.enabledFeatures, __FUNCTION__, __LINE__);		// 0x2000 (1 << 13) FEATURE_RX_PARALLEL_PWM
	
	/* Initialise leds */
	LedInit(LedStatusConfig());
	
	/* Initialise external interrupt */
	EXTIInit();
	
	/* allow configuration to settle */
	delay(100);
	
//	LedSet(LED3_NUM, true);		// LED3_NUM = 0
//	LedSet(LED4_NUM, true);		// LED4_NUM = 1
//	LedSet(LED5_NUM, true);		// LED5_NUM = 2
//	LedSet(LED6_NUM, true);		// LED6_NUM = 3

//	LED3_ON;
//	LED4_ON;
//	LED5_ON;
//	LED6_ON;

//	userBtnPollInit();
	
	/* Initialisae button with interrupt */
//	buttonInit();

	/* Timer must be initialised before any channel is allocated */
	timerInit();					// reinitialise the LED IO configuration to timer AF_PP if USE_LEDTIMER has been set.
									// INFO: To use NORMAL LEDs, turn off the USE_LEDTIMER micro in target.h

#if defined(USE_LEDTIMER)
//	uint16_t idlePulse = LedTimerConfig()->mincommand;
	uint16_t idlePulse = 0;
#if 0
//	uint32_t KhzGain = 50;
	uint32_t KhzGain = 500;
//	printf("idlePulse: %u, %s, %d\r\n", idlePulse, __FUNCTION__, __LINE__);		// idlePulse = 1000 (mincommand)

	ledTimerKhzInit(LedTimerConfig(), idlePulse, LED_NUMBER, KhzGain);
	
	TIM_ARR = 10 * KhzGain;	// KhzGain = 500, TIM_ARR = 10*500 = 5000 (5000 / 10000 = 0.5s = 500ms)
	
//	printf("TIM_ARR: %u\r\n", TIM_ARR);
	
	ledDutyCycle[0] = TIM_ARR * 0.75;		// TIM4 CH1 LED4 PD12
	ledDutyCycle[1] = TIM_ARR * 0.50;		// TIM4 CH2 LED3 PD13
	ledDutyCycle[2] = TIM_ARR * 0.25;		// TIM4 CH3 LED5 PD14
	ledDutyCycle[3] = TIM_ARR * 0.20;		// TIM4 CH4 LED6 PD15
	
	for (int i = 0; i < LED_NUMBER; i++) {
		pwmWriteLed(i, ledDutyCycle[i]);
	}
#else
//	ledTimerMhzInit(LedTimerConfig(), idlePulse, LED_NUMBER);
#endif
#endif
	
	/* Initialise the ESC endpoints */
	mixerInit(MixerConfig()->mixerMode, masterConfig.customMotorMixer);
	
	uint16_t bldcMotoridlePulse = MotorConfig()->mincommand;

	/* Configurate the quadcopter mixer */
	mixerConfigurationOutput();				// motorCount = QUAD_MOTOR_COUNT, reset disarmed motor output to mincommand(1000)

	motorInit(MotorConfig(), bldcMotoridlePulse, getMotorCount());
	
#if defined(USE_PWM)			// USE_PWM is defined in target.h
//	printf("%s, %d\r\n", __FUNCTION__, __LINE__);
	if (feature(FEATURE_RX_PARALLEL_PWM)) {
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		pwmRxInit(PwmConfig());
	}
	
//	IO_t pwmIO = IOGetByTag(PwmConfig()->ioTags[0]);					// IOGetByTag() converts ioTag_t to IO_t
//	printf("IO_GPIO(pwmIO): 0x%x\r\n", (uint32_t)IO_GPIO(pwmIO));		// gpio = 0x40020000 (GPIOA)
//	printf("IO_Pin(pwmIO): %u\r\n", IO_Pin(pwmIO));						// pin = 1 = 0x1 (1 << 0)
#endif

	/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode */
//	TIM5_CH1_Cap_Init(0xFFFFFFFF, 84 - 1);	// 1MHz counter frequency, period (ARR) = 0xFFFFFFFF, psc = 84 - 1 = 83 (1MHz, 1us)
////	TIM5_CH1_Cap_Init(0x10000, 84 - 1);	// 1MHz counter frequency, period (ARR) = 0x10000, psc = 84 - 1 = 83 (1MHz, 1us), 0x10000 is not a proper value to measure the user button high voltage level
	
	/* +--------- TIMER LED TESTING PURPOSES ONLY ---------+ */
//	board_leds_init();
//	timer_clock_init();
//	timer_pwm_init();
//	timer_start();
////	flash_green_led_forever();
	/* +--------- TIMER LED TESTING PURPOSES ONLY ---------+ */
	
#ifdef USE_SPI			// USE_SPI is defined in target.h
	#ifdef USE_SPI_DEVICE_1
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		spiInit(SPIDEV_1);		// SPIDEV_1 = 0
	#endif
	#ifdef USE_SPI_DEVICE_2
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		spiInit(SPIDEV_2);
	#endif
#endif

#ifdef BEEPER
	beeperInit(BeeperConfig());
#endif

#if defined(BEEPER)
	/* Board power on beeper */
	for (int i = 0; i < 10; i++) {
		delay(25);
		BEEP_ON;
		delay(25);
		BEEP_OFF;
	}
#endif

#ifdef USE_I2C			// USE_I2C is defined in target.h
	/* Initialise I2C device */
	i2cInit(I2C_DEVICE);
#endif

#if 0
//	IIC_Init();
#endif
	
//	g_scl = IOGetByTag(IO_TAG(SOFT_I2C_SCL));				// PB10
//	g_sda = IOGetByTag(IO_TAG(SOFT_I2C_SDA));				// PB11
//	ioRec_t *ioRecSDA = IO_Rec(g_sda);
//	printf("IO_GPIO(g_scl): 0x%x\r\n", (uint32_t)IO_GPIO(g_scl));		// gpio = 0x40021000 (GPIOE)
//	printf("IO_Pin(g_scl): %u\r\n", IO_Pin(g_scl));					// pin = 16 = 0x10 (1 << 4)
//	printf("IO_GPIO(g_sda): 0x%x\r\n", (uint32_t)IO_GPIO(g_sda));		// gpio = 0x40021000 (GPIOE)
//	printf("IO_Pin(g_sda): %u\r\n", IO_Pin(g_sda));					// pin = 16 = 0x10 (1 << 4)
	
//	IOConfigGPIO(g_scl, IOCFG_OUT_PP);
//	IOConfigGPIO(g_sda, IOCFG_OUT_PP);
//	IOConfigGPIO(g_scl, IOCFG_OUT_OD);
//	IOConfigGPIO(g_sda, IOCFG_OUT_OD);

//#define YELLOW_LED		PE4
//	IO_t yellowLedPin = IO_NONE;
//	yellowLedPin = IOGetByTag(IO_TAG(YELLOW_LED));
//	IOInit(yellowLedPin, OWNER_LED, 0);
//	IOConfigGPIO(yellowLedPin, IOCFG_OUT_PP);

//	mpuSpi9250CsPin = IOGetByTag(IO_TAG(MPU9250_CS_PIN));
	
//	ioRec_t *ioRecMPUSpi9250Cs = IO_Rec(IOGetByTag(IO_TAG(MPU9250_CS_PIN)));
//	printf("ioRecMPUSpi9250Cs->gpio: 0x%x\r\n", (uint32_t)ioRecMPUSpi9250Cs->gpio);		// gpio = 0x40021000 (GPIOE)
//	printf("ioRecMPUSpi9250Cs->pin: %u\r\n", ioRecMPUSpi9250Cs->pin);					// pin = 16 = 0x10 (1 << 4)

