kyyang28/stm32f407disc_pid/src/quad/target/13-PID/main.c
//	IOInit(mpuSpi9250CsPin, OWNER_MPU_CS, 0);

//	printf("ioRecMPUSpi9250Cs->owner: %u\r\n", ioRecMPUSpi9250Cs->owner);				// owner = 11
//	printf("ioRecMPUSpi9250Cs->index: %u\r\n", ioRecMPUSpi9250Cs->index);				// index = 0
//	printf("%s, %d\r\n", __FUNCTION__, __LINE__);		// ok
//	printf("IO_GPIOPortIdx(mpuSpi9250CsPin): %d\r\n", IO_GPIOPortIdx(mpuSpi9250CsPin));		// IO_GPIOPortIdx(mpuSpi9250CsPin) = 4
//	printf("DEFIO_IO_USED_COUNT: %d\r\n", DEFIO_IO_USED_COUNT);		// DEFIO_IO_USED_COUNT = 80
//	IOConfigGPIO(mpuSpi9250CsPin, SPI_IO_CS_CFG);
//	printf("%s, %d\r\n", __FUNCTION__, __LINE__);		// ok

	
//	short gyro_x, gyro_y, gyro_z;
//	short acc_x, acc_y, acc_z;
//	float temp = 0.0;
//	float roll, pitch, yaw;				// Euler angles
	
//	uint8_t res = MPU_Init();
//	printf("MPU_Init result: %u, %s, %d\r\n", res, __FUNCTION__, __LINE__);

//	while (mpu_dmp_init()) {
//		printf("MPU6050 initialisation error!, %s, %d\r\n", __FUNCTION__, __LINE__);
//		delay(200);
//	}
//	
//	printf("MPU6050 initialisation is done using mpu_dmp_init @%s, %d\r\n", __FUNCTION__, __LINE__);

//	if (!MPU6050_Soft_I2C_Init()) {
//		printf("MPU6050 initialisation is done @%s, %d\r\n", __FUNCTION__, __LINE__);
//	}else {
//		printf("Failed to initialise MPU6050 @%s, %d\r\n", __FUNCTION__, __LINE__);
//		return -1;
//	}

//	if (!MPU9250_Soft_I2C_Init()) {
//		printf("MPU9250 initialisation is done @%s, %d\r\n", __FUNCTION__, __LINE__);
//	}else {
//		printf("Failed to initialise MPU9250 @%s, %d\r\n", __FUNCTION__, __LINE__);
//		return -1;
//	}
	
//	bool flag = false;

	/* board alignment */
	initBoardAlignment(BoardAlignment());

	/* Compare FastInvSqrt(x) and 1/sqrtf(x) */
//	comparisonBetweenFastNormalInvSqrt();
	
#if defined(USE_IMU)			// USE_IMU is defined in target.h
	if (!sensorsAutodetect(GyroConfig(), AccelerometerConfig())) {
		//failureMode();
		printf("Failed to initialise IMU!, %s, %d\r\n", __FUNCTION__, __LINE__);
		while (1) {
			/* BLUE LED */
			LED6_ON;
			delay(100);
			LED6_OFF;
			delay(100);
		}
	}
#endif

#if defined(F450_QUAD_30A_1000KVMOTOR)	
	gyro.targetLooptime = 1000;					// F450 1000KV Motor utilises 1000 us of gyro.targetLooptime
#endif
	
	systemState |= SYSTEM_STATE_SENSORS_READY;

	/* PID configurations
	 * As gyro.targetLooptime is returned from gyroSetSampleRate() function of gyro_sync.c, so we can safely call pidSetTargetLooptime() function now
	 */
//	printf("gyro.targetLooptime: %u\r\n", gyro.targetLooptime);								// 125
//	printf("PidConfig()->pid_process_denom: %u\r\n", PidConfig()->pid_process_denom);		// 4
	
	/* Initialise PID looptime
	 * 
	 * PID looptime = 125 * 4 = 500 us (2 KHz) for F210 racing quad
	 * PID looptime = 1000 * 4 = 4000 us (250 Hz) for F450 racing quad
	 */
	pidSetTargetLooptime(gyro.targetLooptime * PidConfig()->pid_process_denom);
	
	/* Initialise PID filters */
	pidInitFilters(&currentProfile->pidProfile);
	
	/* Initialise PID configurations */
	pidInitConfig(&currentProfile->pidProfile);
	
//	imuInit();
	
	/* MCU Support Package(MSP) initialisation */
	mspFcInit();
	
	/* Testing standard deviation functions */
//	stdev_t var;
//	float dataset[] = {727.7, 1086.5, 1091.0, 1361.3, 1490.5, 1956.1};
//	devClear(&var);
//	for (int i = 0; i < sizeof(dataset)/sizeof(dataset[0]); i++) {
//		devPush(&var, dataset[i]);
//	}
//	float dev = devStandardDeviation(&var);
//	printf("dev: %f, %s, %d\r\n", dev, __FUNCTION__, __LINE__);					// 420.962463
//	printf("devint: %ld, %s, %d\r\n", lrintf(dev), __FUNCTION__, __LINE__);		// 421

	/* Initialise RX receiver */
	rxInit(RxConfig(), ModeActivationProfile()->modeActivationConditions);
	
#ifdef USE_SDCARD
	if (feature(FEATURE_SDCARD) && BlackboxConfig()->device == BLACKBOX_SDCARD) {
//		printf("USE_SDCARD, %s, %d\r\n", __FUNCTION__, __LINE__);
		sdcardInsertionDetectInit();
		sdcard_init(SdcardConfig()->useDma);		// SdcardConfig()->useDma = false for now, use DMA later
		afatfs_init();
//		if (!sdcard_isInserted()) {
//			printf("SDCARD is not present!\r\n");
//		}else {
//			printf("SDCARD is present!\r\n");
//		}
	}
#endif
	
#ifdef BLACKBOX
	initBlackbox();
#endif

#if defined(USE_IMU)
	/* set gyro calibration cycles */
	gyroSetCalibrationCycles();
#endif

	DISABLE_ARMING_FLAG(PREVENT_ARMING);
	
//	const timeUs_t currentTimeUsAfter = micros();
//	printf("currentTimeUsAfter processRx: %u, %s, %d\r\n", currentTimeUsAfter, __FUNCTION__, __LINE__);

	/* Latch active features again as some of them are modified by init() */
	latchActiveFeatures();
	
	/* Set the motorControlEnable flag to be TRUE to control the motors */
	motorControlEnable = true;

//	uint16_t ledpwmval = 1500;
//	uint8_t dir = 1;
	
//	printf("sizeof(master_t): %u\r\n", sizeof(master_t));			// sizeof(master_t): 868 so far

//    extern cfTask_t *taskQueueArray[TASK_COUNT + 1];

    /* Initialise all the RTOS tasks */
    fcTasksInit();
	
	systemState |= SYSTEM_STATE_ALL_READY;
    
//    printf("taskQueueArray[0]->taskName = %s\r\n", taskQueueArray[0]->taskName);                        // taskName = "SYSTEM"
//    printf("taskQueueArray[0]->desiredPeriod = %u\r\n", taskQueueArray[0]->desiredPeriod);              // desiredPeriod = 100000
//    printf("taskQueueArray[0]->staticPriority = %u\r\n\r\n", taskQueueArray[0]->staticPriority);        // staticPriority = 4

//    printf("taskQueueArray[1]->taskName = %s\r\n", taskQueueArray[1]->taskName);                        // taskName = "LED"
//    printf("taskQueueArray[1]->desiredPeriod = %u\r\n", taskQueueArray[1]->desiredPeriod);              // desiredPeriod = 500000
//    printf("taskQueueArray[1]->staticPriority = %u\r\n", taskQueueArray[1]->staticPriority);            // staticPriority = 4

//    printf("taskName\t taskPeriod\r\n");

	/* Main loop */
	while (1) {
        
        main_process();

//		delay(10);

//		if (dir) {
//			ledpwmval++;
//		}else {
//			ledpwmval--;
//		}
//		
//		if (ledpwmval > 2000) {
//			dir = 0;
//		}
//		
//		if (ledpwmval == 0) {
//			dir = 1;
//		}

//		for (int i = 0; i < getMotorCount(); i++) {
//			pwmWriteMotor(i, ledpwmval);
//		}
//		
////		for (int i = 0; i < LED_NUMBER; i++) {
////			pwmWriteLed(i, ledpwmval);
////		}
				
