kyyang28/stm32f407disc_pid/src/quad/target/13-PID/main.c
#if 0
		const timeUs_t currentTimeUs = micros();
//		printf("currentTimeUs before processRx: %u, %s, %d\r\n", currentTimeUs, __FUNCTION__, __LINE__);
		
//		rxSignalReceived = rxSignalReceivedNotDataDriven;		// rxSignalReceivedNotDataDriven initial false
//		rxIsInFailsafeMode = rxIsInFailsafeModeNotDataDriven;	// rxIsInFailsafeModeNotDataDriven initial true
		
		/* TODO: rxUpdateCheck() function will be running in a separate RTOS task */
		rxUpdateCheck(currentTimeUs, 0);			// update the rxSignalReceivedNotDataDriven, rxIsInFailsafeModeNotDataDriven, rxSignalReceived and rxIsInFailsafeMode
	
		taskUpdateRxMain(currentTimeUs);		// calling processRx(), updateRcCommands()
//		processRx(currentTimeUs);		// processRx function is called inside the taskUpdateRxMain function
		
		taskMainPidLoop(currentTimeUs);
		
//		delay(200);			// taskUpdateRxMain() update period = 200 ms (testing rx ONLY)
		delay(20);				// taskUpdateRxMain() update period = 20 ms (20000 us = 50 Hz), for MOTORS testing
#endif
		
#ifdef 0
//		BEEP_ON;		// turn beeper on
//		delay(200);
//		BEEP_OFF;		// turn beeper off
//		delay(200);

	for (int i = 0; i < 10; i++) {
//		LED3_TOGGLE;
//		LED4_TOGGLE;
		delay(25);
		BEEP_ON;
		delay(25);
		BEEP_OFF;
	}
	delay(2000);
#endif
		
//		gyroUpdate();													// read gyro data
//		delay(100);
#if 0
		gyroUpdate();													// read gyro data
//		accUpdate(&AccelerometerConfig()->accelerometerTrims);			// read acc data
		if (gyro.dev.mpuDetectionResult.sensor == MPU_60x0 && gyro.dev.calibrationFlag) {
//			printf("MPU6050 data - gyroADCRaw[X]: %d, gyroADCRaw[Y]: %d, gyroADCRaw[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.dev.gyroADCRaw[X], gyro.dev.gyroADCRaw[Y], gyro.dev.gyroADCRaw[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU6050 data - gyroADCCali[X]: %d, gyroADCCali[Y]: %d, gyroADCCali[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyroADC[X], gyroADC[Y], gyroADC[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//		}else if (gyro.dev.mpuDetectionResult.sensor == MPU_9250_I2C) {
		}else if (gyro.dev.mpuDetectionResult.sensor == MPU_9250_I2C && gyro.dev.calibrationFlag) {
			printf("MPU9250 (I2C) data - gyroADCRaw[X]: %d, gyroADCRaw[Y]: %d, gyroADCRaw[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.dev.gyroADCRaw[X], gyro.dev.gyroADCRaw[Y], gyro.dev.gyroADCRaw[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU9250 (I2C) data - gyroADCCali[X]: %d, gyroADCCali[Y]: %d, gyroADCCali[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyroADC[X], gyroADC[Y], gyroADC[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU9250 (I2C) data - gyroADCfiltered[X]: %.4f, gyroADCfiltered[Y]: %.4f, gyroADCfiltered[Z]: %.4f, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.gyroADCf[X], gyro.gyroADCf[Y], gyro.gyroADCf[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
		}else if (gyro.dev.mpuDetectionResult.sensor == MPU_9250_SPI && gyro.dev.calibrationFlag) {
//			printf("MPU9250 (SPI) data - gyroADCRaw[X]: %d, gyroADCRaw[Y]: %d, gyroADCRaw[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.dev.gyroADCRaw[X], gyro.dev.gyroADCRaw[Y], gyro.dev.gyroADCRaw[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
//			printf("MPU9250 (SPI) data - gyroADCCali[X]: %d, gyroADCCali[Y]: %d, gyroADCCali[Z]: %d, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyroADC[X], gyroADC[Y], gyroADC[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
			printf("MPU9250 (SPI) data - gyroADCfiltered[X]: %.4f, gyroADCfiltered[Y]: %.4f, gyroADCfiltered[Z]: %.4f\r\n", gyro.gyroADCf[X], gyro.gyroADCf[Y], gyro.gyroADCf[Z]);
//			printf("MPU9250 (SPI) data - gyroADCfiltered[X]: %.4f, gyroADCfiltered[Y]: %.4f, gyroADCfiltered[Z]: %.4f, accADC[X]: %d, accADC[Y]: %d, accADC[Z]: %d\r\n", gyro.gyroADCf[X], gyro.gyroADCf[Y], gyro.gyroADCf[Z], acc.dev.ADCRaw[X], acc.dev.ADCRaw[Y], acc.dev.ADCRaw[Z]);
		}
//		printf("gyro.dev.gyroADCRaw[X]: %d, %s, %d\r\n", gyro.dev.gyroADCRaw[X], __FUNCTION__, __LINE__);
//		printf("gyro.dev.gyroADCRaw[Y]: %d, %s, %d\r\n", gyro.dev.gyroADCRaw[Y], __FUNCTION__, __LINE__);
//		printf("gyro.dev.gyroADCRaw[Z]: %d, %s, %d\r\n", gyro.dev.gyroADCRaw[Z], __FUNCTION__, __LINE__);
		delay(50);
#endif
		
#if 0
		if (mpu_dmp_get_data(&pitch, &roll, &yaw) == 0) {
			/* Get raw data of MPU6050 (gyroscope, accelerometer, temperature) */
			MPU6050_Get_Gyroscope_Data(&gyro_x, &gyro_y, &gyro_z);
			MPU6050_Get_Accelerometer_Data(&acc_x, &acc_y, &acc_z);
			temp = MPU6050_Get_Temperature_Data();
			/* Send data to ANO flight controller software */
			mpu6050_send_data(acc_x, acc_y, acc_z, gyro_x, gyro_y, gyro_z);
			usart3_report_imu(acc_x, acc_y, acc_z, gyro_x, gyro_y, gyro_z, (int)(roll*100), (int)(pitch*100), (int)(yaw*10));
			/* Display on serial terminal */
//			printf("MPU6050 data - gyro_x: %d, gyro_y: %d, gyro_z: %d, acc_x: %d, acc_y: %d, acc_z: %d, temp: %.2f\r\n", gyro_x, gyro_y, gyro_z, acc_x, acc_y, acc_z, temp);
//			printf("Euler angles - roll: %.4f, pitch: %.4f, yaw: %.4f\r\n\r\n", roll, pitch, yaw);
//			delay(100);
		}else {
//			printf("mpu_dmp_get_data failed, %s, %d\r\n", __FUNCTION__, __LINE__);
//			delay(100);
		}
#endif

#if 0
		MPU6050_Get_Gyroscope_Data(&gyro_x, &gyro_y, &gyro_z);
		MPU6050_Get_Accelerometer_Data(&acc_x, &acc_y, &acc_z);
		temp = MPU6050_Get_Temperature_Data();
//		printf("MPU6050 gyro data: gyro_x: %d, gyro_y: %d, gyro_z: %d\r\n", gyro_x, gyro_y, gyro_z);
//		printf("MPU6050 temp data: %.2f\r\n", temp);
		printf("MPU6050 data - gyro_x: %d, gyro_y: %d, gyro_z: %d, acc_x: %d, acc_y: %d, acc_z: %d, temp: %.2f\r\n", gyro_x, gyro_y, gyro_z, acc_x, acc_y, acc_z, temp);		
		delay(100);
#endif

#if 0
		MPU9250_Get_Gyroscope_Data(&gyro_x, &gyro_y, &gyro_z);
		MPU9250_Get_Accelerometer_Data(&acc_x, &acc_y, &acc_z);
		temp = MPU9250_Get_Temperature_Data();
//		printf("MPU6050 gyro data: gyro_x: %d, gyro_y: %d, gyro_z: %d\r\n", gyro_x, gyro_y, gyro_z);
//		printf("MPU6050 temp data: %.2f\r\n", temp);
		printf("MPU9250 data - gyro_x: %d, gyro_y: %d, gyro_z: %d, acc_x: %d, acc_y: %d, acc_z: %d, temp: %.2f\r\n", gyro_x, gyro_y, gyro_z, acc_x, acc_y, acc_z, temp);		
		delay(100);
#endif

