kyyang28/stm32f407disc_pid/src/quad/target/13-PID/main.c
#if 0
//#ifdef USE_PWM			// USE_PWM is defined in target.h
		/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode
		 * Make sure to use the following uint32_t type for captures
		 * 	-- uint32_t captures[PWM_PORTS_OR_PPM_CAPTURE_COUNT];
		 *  -- static void pwmEdgeCallback(timerCCHandlerRec_t *cbRec, timCCR_t capture)
		 *  -- static void pwmOverflowCallback(timerOvrHandlerRec_t *cbRec, timCCR_t capture)
		 *  -- 	timCCR_t rise;				// timCCR_t is uint32_t
		 *  -- 	timCCR_t fall;				// timCCR_t is uint32_t
		 *  -- 	timCCR_t capture;				// timCCR_t is uint32_t
		 *  -- 	//	captureCompare_t rise;		// captureCompare_t is uint16_t
		 *  -- 	//	captureCompare_t fall;
		 *  -- 	//	captureCompare_t capture;
		 */
		delay(10);
//		printf("TIM_CAPTURE_STATUS: 0x%x, %s, %d\r\n", TIM_CAPTURE_STATUS, __FUNCTION__, __LINE__);
		if (TIM_CAPTURE_STATUS & 0x80) {			// check if the time period between the rising and falling edge of the signal is captured.
			/* print the time period */
			printf("The period of signal high: %u us\r\n", pwmRead(TIM_Channel_1));		// TIM_Channel_1 = 0x0
			TIM_CAPTURE_STATUS = 0x0;				// clear the status to zero for the next timer input capture
		}
		
		/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode */
//		delay(10);
//		if (TIM5_CH1_CAPTURE_STATUS & 0x80) {		// 0x80: 1 << 7 (capture successful)
//			printf("TIM5_CH1_CAPTURE_VAL: %u\r\n", TIM5_CH1_CAPTURE_VAL);
////			temp = TIM5_CH1_CAPTURE_STATUS & 0x3F;
////			temp *= 0xFFFFFFFF;						// sum of overflow value
//			temp += TIM5_CH1_CAPTURE_VAL;			// retrieve total time period of high voltage level
//			printf("HIGH: %lld us\r\n", temp);
//			TIM5_CH1_CAPTURE_STATUS = 0;			// clear capture status to enable the next input capture
//		}
	/* Testing USER button (PA0) high voltage level time period using TIM5 Input Capture mode */
#endif
		
		/* +----------------------------------------------------------------------------------------+ */
		/* +------------------------------- bus_i2c_soft API testing -------------------------------+ */
		/* +----------------------------------------------------------------------------------------+ */
//		flag = I2C_Start();			// test ok
//		printf("I2C_Start flag: %d, %s, %d\r\n", flag, __FUNCTION__, __LINE__);
//		I2C_Stop();					// test ok
//		I2C_Ack();					// test ok
//		I2C_NoAck();				// test ok
//		flag = I2C_WaitAck();		// test ok
//		printf("I2C_WaitAck flag: %d, %s, %d\r\n", flag, __FUNCTION__, __LINE__);
//		I2C_SendByte(0x59);			// test ok, sends 'Y'
		/* +----------------------------------------------------------------------------------------+ */
		/* +------------------------------- bus_i2c_soft API testing -------------------------------+ */
		/* +----------------------------------------------------------------------------------------+ */
		
//		IIC_Start();
//		delay(1000);

//		IIC_Stop();
//		delay(1000);

//		IIC_Ack();
//		delay(1000);
//		IIC_NAck();
//		delay(1000);
		
//		IIC_SCL = 0;
//		delay(500);
//		IIC_SCL = 1;
//		delay(500);
		
//		IIC_SDA = 0;
//		delay(800);
//		IIC_SDA = 1;
//		delay(800);

//		printf("STM32F407 by QUADYANG using USART3 Port\r\n");
//		delay(1000);
		
//		IOHi(g_sda);
//		IOHi(g_scl);
////		I2C_delay();
//		delay(500);
//		printf("sda: %d\r\n", IORead(g_sda));
		
//		IOHi(g_scl);
//		IOHi(g_sda);
//		delay(500);
//		printf("scl: %d\r\n", IORead(g_scl));
//		printf("sda: %d\r\n", IORead(g_sda));
//		IOLo(g_scl);
//		IOLo(g_sda);
//		delay(500);
//		printf("scl: %d\r\n", IORead(g_scl));
//		printf("sda: %d\r\n", IORead(g_sda));

//		IOHi(g_sda);
//		delay(500);
//		printf("sda: %d\r\n", IORead(g_sda));

//		IOLo(g_sda);
//		delay(500);
//		printf("sda: %d\r\n", IORead(g_sda));		
		
//		IOHi(g_sda);
//		IOHi(g_scl);
////		I2C_delay();
//		delay(1000);
//		sdaFlag = IORead(g_sda);
//		printf("sdaFlag: %d\r\n", sdaFlag);
		
//		I2C_Start();
//		delayMicroseconds(3);
//		I2C_Stop();
//		delayMicroseconds(3);

//		printf("STM32F407 by QUADYANG using USART1 Port\r\n");
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//		f_cnt += 0.01;
//		printf("i_cnt: %d, f_cnt: %.4f\r\n", i_cnt++, f_cnt);
//		delay(1000);

//		IOWrite(yellowLedPin, false);		// high
//		delay(1000);
//		IOWrite(yellowLedPin, true);		// low
//		delay(1000);

//		mpu9250WriteRegister(0x1B, 0x10);
//		delay(1000);
//		uint8_t in;
//		mpu9250ReadRegister(0x1B, 1, &in);
//		printf("in: 0x%x\r\n", in);
		
//		IOLo(mpuSpi9250CsPin);
//		delayMicroseconds(1);
////		delay(1000);
//		spiTransferByte(MPU9250_SPI_INSTANCE, 0x1B);
//		IOHi(mpuSpi9250CsPin);
//		delayMicroseconds(1);

//		IOLo(mpuSpi9250CsPin);
//		delay(800);
//		IOHi(mpuSpi9250CsPin);
//		delay(800);
		
//		printf("QUADYANG\n");
//		delay(1000);
		//counter++;
				
//		userBtnPollOps();

//		gpioPA1Ops();
//		gpioPB8Ops();
		
//		LED3_ON;
//		delay(1000);
//		LED3_OFF;
//		delay(1000);
		
//		LED4_ON;
//		delay(700);
//		LED4_OFF;
//		delay(700);

//		LED5_ON;
//		delay(400);
//		LED5_OFF;
//		delay(400);

//		LED6_ON;
//		delay(100);
//		LED6_OFF;
//		delay(100);
		
//		msElapse = millis();
//		currentTimeUs = micros();
	}
//	return 0;
}

void EnableGPIOClk(void)
{
	/* AHB1 clocks enable */
	RCC_AHB1PeriphClockCmd(
		RCC_AHB1Periph_GPIOA 	|
		RCC_AHB1Periph_GPIOB 	|
		RCC_AHB1Periph_GPIOC 	|
		RCC_AHB1Periph_GPIOD 	|
		RCC_AHB1Periph_GPIOE 	|
		RCC_AHB1Periph_GPIOH 	|
		RCC_AHB1Periph_CRC	 	|
		RCC_AHB1Periph_FLITF 	|
		RCC_AHB1Periph_SRAM1	|
		RCC_AHB1Periph_SRAM2	|
		RCC_AHB1Periph_BKPSRAM	|
		RCC_AHB1Periph_DMA1		|
		RCC_AHB1Periph_DMA2		|
		0, ENABLE
	);
	
	/* AHB2 clocks enable */
	RCC_AHB2PeriphClockCmd(0, ENABLE);
	
	/* APB1 clocks enable */
	RCC_APB1PeriphClockCmd(
		RCC_APB1Periph_PWR		|
//		RCC_APB1Periph_I2C3		|	
//		RCC_APB1Periph_I2C2		|	
//		RCC_APB1Periph_I2C1		|	
		RCC_APB1Periph_USART2	|	
		RCC_APB1Periph_SPI3		|	
		RCC_APB1Periph_SPI2		|	
		RCC_APB1Periph_WWDG		|	
		RCC_APB1Periph_TIM5		|	
		RCC_APB1Periph_TIM4		|	
		RCC_APB1Periph_TIM3		|	
		RCC_APB1Periph_TIM2		|	
		0, ENABLE
	);
	
